# Переменные 
my_var = 100
myVar2 = 200
c = my_var + myVar2

print(c) 

#*** типы данных 
# _int = 10000
# _float = 5000.001

#  my_str = "Prive Mir!"

# print(my_str)

#Булевые типы данных( boolean, bool)
# True/False
my_bool = True  # истина, логическая 1, False -логический 0
# ***  Способ форматиование строк под названием "f-строка" ***

# Стареший способ форматирование конкатенация 
z = "12"
r = "32"
q = "24!"

s = z + r + q

# print(s)


res = f"первое слово{z} второе слово{r} третье слово{q}"
# print(res)


# * Арифметические операции **

var_1 = 4
var_2 = 2

# Сложение
print(var_1 + var_2)
# Вычитание
print(var_1 - var_2)

#Умножение 
print(var_1 * var_2)

# Операция простого деления 
# возвращает всегда тип float
print(var_1/ var_2)

# операция целочисленого делеления
# возвращает всегда тип int 
#  при этом без округления 
print(var_1// var_2)